{
  "backend/main.mo": "Motoko canister implementing account creation, user profiles, and admin‑gated account queries using role‑based access control.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file.",
  "frontend/index.css": "Tailwind base and theme variable definitions configuring colors, dark mode, and global styling.",
  "frontend/index.html": "HTML entry point loading the React app with updated title TelsFX.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, layout, and page components including new admin‑help route.",
  "frontend/src/components/AdminAccessGate.tsx": "UI gate that checks Internet Identity login and admin status, showing login prompts or access denial with principal info.",
  "frontend/src/components/DisclaimerNotice.tsx": "Empty placeholder file for the disclaimer notice component.",
  "frontend/src/components/GetStartedForm.tsx": "Account creation form handling input validation, submission, and success flow using a createAccount mutation.",
  "frontend/src/components/GreenSectionCard.tsx": "A styled Card wrapper applying green gradient theming and hover effects.",
  "frontend/src/components/ProfileTile.tsx": "Displays a user profile avatar with name, optional title, and optional placeholder badge.",
  "frontend/src/components/RouteTransitionOverlay.tsx": "Shows a full‑screen loading overlay during route transitions.",
  "frontend/src/components/SiteFooter.tsx": "Footer displaying recognition content, Tesla‑related companies, legal links, and navigation using route transitions.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with navigation, logo, and mobile menu using route transition handling.",
  "frontend/src/components/UsersWorldwideKpi.tsx": "Fetches account stats and animates a rising user count KPI display.",
  "frontend/src/config/admin.ts": "Defines the admin principal constant to control admin access.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for Internet Identity authentication, handling login, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for account creation, fetching account stats, listing accounts, managing user profiles, and checking admin status via an actor API.",
  "frontend/src/hooks/useRouteTransition.tsx": "Implements a context and hook for timed route transitions with a brief loading state and automated cleanup.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme CSS variables for light and dark modes, and custom scrollbar utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AccessPlansPage.tsx": "Displays selectable partnership plans and triggers a route transition to the signup page with chosen plan metadata.",
  "frontend/src/pages/AdminHelpPage.tsx": "Provides admin instructions for obtaining and configuring an Internet Identity Principal.",
  "frontend/src/pages/AdminUsersPage.tsx": "Wraps an admin-only table that loads and displays all user accounts, handling loading and error states.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, KPI display, and feature cards, using route transition to navigate after signup.",
  "frontend/src/pages/PlanSignupPage.tsx": "Signup form page validating user input and creating an account tied to a selected plan before redirecting to success.",
  "frontend/src/pages/PlanSuccessPage.tsx": "Success screen confirming account creation and prompting users to continue setup on Telegram.",
  "frontend/src/pages/PlanTelegramPage.tsx": "Page directing users to join a Telegram channel with steps explaining what happens next.",
  "frontend/src/pages/PrivacyPage.tsx": "Scrollable privacy policy page outlining data collection, usage, and disclosure details.",
  "frontend/src/pages/ProductsPage.tsx": "Product categories page listing sustainable tech offerings with icons, descriptions, and feature lists.",
  "frontend/src/pages/TelegramPage.tsx": "Standalone Telegram CTA page guiding users to join the official community to complete their setup.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms & Conditions page with scrollable legal text inside a styled card layout.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, storing them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Tracks project state, requirements, issues, and architectural notes for ongoing development."
}