{
  "backend/main.mo": "Motoko backend managing admin/user authentication, accounts, sessions, and basic access control state.",
  "feature_evidence.json": "Feature evidence listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Generated summaries describing the purpose of key frontend pages, components, hooks, and config files.",
  "frontend/index.css": "Global Tailwind CSS variables, dark mode colors, and base styling applied across the app.",
  "frontend/index.html": "Basic HTML entry point mounting the React app with updated TelsFX title.",
  "frontend/src/App.tsx": "Main React app configuring routes, global background layout, query client, transitions, and root providers.",
  "frontend/src/components/AdminAccessGate.tsx": "Empty placeholder component file.",
  "frontend/src/components/DisclaimerNotice.tsx": "Alert component displaying a prominent disclaimer about non-affiliation with referenced companies.",
  "frontend/src/components/FloatingAdminButton.tsx": "Empty placeholder component file.",
  "frontend/src/components/GetStartedForm.tsx": "Empty placeholder component file.",
  "frontend/src/components/GreenSectionCard.tsx": "Reusable card component with emerald‑to‑teal gradient styling that supports standard div props.",
  "frontend/src/components/HeaderHamburgerMenu.tsx": "Mobile hamburger menu providing navigation through a sliding sheet with transition-aware routing.",
  "frontend/src/components/ProfileTile.tsx": "Profile tile showing avatar, name, optional title, and optional placeholder badge.",
  "frontend/src/components/RouteTransitionOverlay.tsx": "Fullscreen loading overlay displayed during route transitions via useRouteTransition.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with navigation links, legal links, recognition section, and branding.",
  "frontend/src/components/SiteHeader.tsx": "Renders the site header with logo navigation and a hamburger menu.",
  "frontend/src/components/UsersWorldwideKpi.tsx": "Displays an animated KPI showing total users worldwide using account statistics.",
  "frontend/src/config/admin.ts": "Empty configuration file for admin settings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAdminReveal.tsx": "Empty hook file reserved for admin reveal logic.",
  "frontend/src/hooks/useAdminSession.ts": "Handles admin login, session validation, token storage, and logout using react-query and the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and identity management using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Contains react-query hooks for account creation, login, statistics, account listing, and user profile retrieval.",
  "frontend/src/hooks/useRouteTransition.tsx": "Implements a route transition context with delayed navigation and spinner state management.",
  "frontend/src/index.css": "Tailwind setup defining theme CSS variables, dark mode variants, global typography, custom scrollbar, and a fixed vector background layer.",
  "frontend/src/main.tsx": "App entry point configuring React Query, Internet Identity provider, and rendering the main App component.",
  "frontend/src/pages/AccessPlansPage.tsx": "Renders plan selection UI with pricing, features, and navigation logic for signup and login flows.",
  "frontend/src/pages/AdminHelpPage.tsx": "Empty placeholder file.",
  "frontend/src/pages/AdminLoginPage.tsx": "Empty placeholder file.",
  "frontend/src/pages/AdminUsersPage.tsx": "Admin page enforcing session checks and displaying a table of user accounts with loading and error handling.",
  "frontend/src/pages/LandingPage.tsx": "Landing page featuring a hero section, mission overview, KPIs, and navigation to partnership plans.",
  "frontend/src/pages/PlanLoginPage.tsx": "Login page for plan-based flows with validation, session flag checks, and post-login routing to the profit page.",
  "frontend/src/pages/PlanPostSignupPage.tsx": "Displays a welcome page after signup showing plan-specific profit and product details based on the selected plan.",
  "frontend/src/pages/PlanProfitPage.tsx": "Shows main and extra profit details for a selected plan, resolving the plan tier from URL or session storage.",
  "frontend/src/pages/PlanSignupPage.tsx": "Provides a signup form with validation and account creation tied to a selected plan tier.",
  "frontend/src/pages/PlanSuccessPage.tsx": "Empty placeholder page for future plan success content.",
  "frontend/src/pages/PlanTelegramPage.tsx": "Displays instructions and a button for users to join the project's Telegram channel.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders a scrollable privacy policy detailing data collection, usage, and disclosure practices.",
  "frontend/src/pages/ProductsPage.tsx": "Lists product categories with descriptions and features related to sustainable technology solutions.",
  "frontend/src/pages/TelegramPage.tsx": "Renders a standalone Telegram CTA page with branding, descriptive text, and a button linking to the official Telegram community.",
  "frontend/src/pages/TermsPage.tsx": "Displays the Terms & Conditions page with scrollable sections inside a styled card layout.",
  "frontend/src/utils/backendErrorMessage.ts": "Normalizes backend errors into clean user-facing messages with specific handling for known and network-related errors.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting, persisting, and clearing URL parameters and session-based values.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugin integrations for the project.",
  "project_state.json": "Stores the project state, requirements, architectural notes, and known issues for ongoing development."
}