{
  "backend/main.mo": "Motoko canister implementing account creation, access control checks, and user profile storage with admin-restricted queries.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles of various frontend files across pages, components, hooks, and config.",
  "frontend/index.css": "Tailwind base and theme variable definitions establishing light/dark color tokens and global styles.",
  "frontend/index.html": "HTML entry point defining the root container and loading the main React script.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, shared layout, and all route definitions including new /privacy page.",
  "frontend/src/components/AdminAccessGate.tsx": "Gate component enforcing admin-only access using identity login and admin verification checks.",
  "frontend/src/components/DisclaimerNotice.tsx": "Empty placeholder file for a disclaimer component.",
  "frontend/src/components/GetStartedForm.tsx": "Account creation form that validates inputs and triggers backend mutation with UI feedback and optional navigation.",
  "frontend/src/components/GreenSectionCard.tsx": "Reusable gradient card wrapper supporting HTML div attributes for clickable sections.",
  "frontend/src/components/ProfileTile.tsx": "Profile display component showing avatar, name, optional title, and optional placeholder badge.",
  "frontend/src/components/RouteTransitionOverlay.tsx": "Displays a full-screen loading overlay when a route transition is active.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with recognition sections, associated companies, legal links, and route-transition navigation.",
  "frontend/src/components/SiteHeader.tsx": "Provides the main header with logo, navigation, and mobile menu using route-transition-based navigation.",
  "frontend/src/components/UsersWorldwideKpi.tsx": "Shows an animated global user count KPI based on fetched account statistics.",
  "frontend/src/config/admin.ts": "Exports a placeholder admin principal configuration value.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, exposing identity state, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for account operations, user profiles, admin checks, and statistics using the backend actor.",
  "frontend/src/hooks/useRouteTransition.tsx": "Implements a context for route transitions, showing a short overlay and handling timed navigation.",
  "frontend/src/index.css": "Configures Tailwind layers, defines light/dark theme CSS variables, and adds custom scrollbar styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider and loads global styles.",
  "frontend/src/pages/AccessPlansPage.tsx": "Displays available partnership plans with pricing and features and routes users to the signup page on selection.",
  "frontend/src/pages/AdminUsersPage.tsx": "Admin‑only page that lists all user accounts, supports logout, and shows loading or empty states.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero content, KPIs, and feature cards that guides users toward signup.",
  "frontend/src/pages/PlanSignupPage.tsx": "Signup form for a selected plan with validation and backend account creation using react‑query.",
  "frontend/src/pages/PlanSuccessPage.tsx": "Success screen shown after account creation prompting the user to continue setup via Telegram.",
  "frontend/src/pages/PlanTelegramPage.tsx": "Displays a guided page prompting users to join a Telegram channel with steps and a button linking to the channel.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders the Privacy Policy page with scrollable detailed sections on data collection, usage, cookies, and disclosure.",
  "frontend/src/pages/ProductsPage.tsx": "Shows a list of product categories using cards, each with an icon, description, and feature list.",
  "frontend/src/pages/TelegramPage.tsx": "A welcome page urging new users to join a Telegram community via a CTA button.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms & Conditions page with scrollable detailed sections on usage, accounts, and service terms.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session parameters, including support for hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and components with custom OKLCH variables, plugins, and container settings.",
  "project_state.json": "Project metadata describing versioned state, rebrand requirements, legal constraints, routing behavior, and known issues for the TelsFX site."
}