{
  "backend/main.mo": "Motoko canister managing accounts and user profiles with admin-gated queries and role-based authorization.",
  "feature_evidence.json": "Feature evidence report describing a footer update linking Contact Us to the /telegram route.",
  "frontend-file-summaries.txt": "Pre-existing summary list of various frontend files and their purposes.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, dark mode values, and global border/background text styling.",
  "frontend/index.html": "HTML entry point setting up the root element and loading the main TSX script.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, global layout, transitions, and wraps pages with shared UI components.",
  "frontend/src/components/AdminAccessGate.tsx": "Component gating admin-only content using Internet Identity and admin role checks with loading and denial states.",
  "frontend/src/components/DisclaimerNotice.tsx": "Empty placeholder component file.",
  "frontend/src/components/GetStartedForm.tsx": "Account creation form with validation and backend mutation followed by optional navigation callback.",
  "frontend/src/components/GreenSectionCard.tsx": "Styled card wrapper with green gradient and hover effects supporting div attributes.",
  "frontend/src/components/ProfileTile.tsx": "Profile display tile showing avatar, name, optional title, and placeholder badge.",
  "frontend/src/components/RouteTransitionOverlay.tsx": "Full‑screen loading overlay shown during global route transitions.",
  "frontend/src/components/SiteFooter.tsx": "Renders a footer with industry recognition, a Tesla-associated companies list, legal navigation buttons, and dynamic copyright.",
  "frontend/src/components/SiteHeader.tsx": "Implements a responsive site header with logo, navigation links, mobile menu, and route transitions.",
  "frontend/src/components/UsersWorldwideKpi.tsx": "Displays an animated worldwide user count fetched from account statistics.",
  "frontend/src/config/admin.ts": "Defines a placeholder admin principal string for configuration.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous actor, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, and identity loading logic.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for account creation, account statistics, profile management, and admin checks using the actor.",
  "frontend/src/hooks/useRouteTransition.tsx": "Provides a context and hook for animated route transitions with timed navigation and cleanup.",
  "frontend/src/index.css": "Defines Tailwind layers, CSS variables for themes, base typography, and custom scrollbar styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers, then renders App.",
  "frontend/src/pages/AccessPlansPage.tsx": "Displays a grid of selectable partnership plans and navigates users to the signup page with the chosen plan.",
  "frontend/src/pages/AdminUsersPage.tsx": "Admin-only page that lists user accounts with loading, error, and logout handling.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page featuring hero content, KPI display, and promo sections for user engagement.",
  "frontend/src/pages/PlanSignupPage.tsx": "Signup form for creating an account under a selected plan with validation and backend submission.",
  "frontend/src/pages/PlanSuccessPage.tsx": "Confirmation page shown after account creation with a prompt to continue to Telegram.",
  "frontend/src/pages/PlanTelegramPage.tsx": "Renders a page prompting users to join a Telegram channel with steps and a button linking to the channel.",
  "frontend/src/pages/PrivacyPage.tsx": "Displays the privacy policy with scrollable sections outlining data collection, usage, and disclosure.",
  "frontend/src/pages/ProductsPage.tsx": "Shows a list of product categories with icons, descriptions, and features inside styled cards.",
  "frontend/src/pages/TelegramPage.tsx": "Provides a welcome page encouraging new users to join the Telegram community with a call‑to‑action button.",
  "frontend/src/pages/TermsPage.tsx": "Displays the terms and conditions in a scrollable card with multiple detailed sections.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, storing, retrieving, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended OKLCH-based color system, layout settings, custom keyframes, and animations.",
  "project_state.json": "Defines the project's current state, requirements, architectural notes, known issues, and existing features for ongoing development and rebranding work."
}