{
  "kind": "build_request",
  "title": "Replace dual green gradients with pronounced global green-to-teal vector abstract background",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-93",
      "text": "Generate a new vector-based abstract background design that transitions from green to teal and is visually pronounced.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5"
        ],
        "quotes": [
          "Create an vector-based abstract background design that gradually transitions from green to a color that looks best and it's should be added to all the pages in the website.",
          "Teal will be okay and it's should replace the existence dual green gradient because I didn't like it and it's should be more visually pronounced."
        ]
      },
      "acceptanceCriteria": [
        "A new vector background asset (SVG) exists under `frontend/public/assets/generated/` and visually transitions from green to teal with prominent abstract shapes.",
        "The background is original and does not use any third-party branding, logos, or copyrighted artwork."
      ]
    },
    {
      "id": "REQ-94",
      "text": "Replace the existing global dual-layer green gradient background (currently applied via the `gradient-bg-right` class and its `::before/::after` layers) with the new green-to-teal vector background, and apply it globally across all routes/pages from a single global place (global CSS and/or the root layout container).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "Create an vector-based abstract background design that gradually transitions from green to a color that looks best and it's should be added to all the pages in the website.",
          "Teal will be okay and it's should replace the existence dual green gradient because I didn't like it and it's should be more visually pronounced.",
          "Proceed"
        ]
      },
      "acceptanceCriteria": [
        "The previous dual-gradient effect is no longer visible anywhere in the app (no remaining `::before/::after` radial gradient layers for `gradient-bg-right`).",
        "All pages/routes show the new vector green-to-teal background consistently, without per-page modifications.",
        "Foreground content (header, pages, footer, cards) remains readable and layered above the background (no interference with clicks/scrolling).",
        "No existing routes, navigation behavior, or route-transition spinner/fade behavior is changed by this background update."
      ]
    }
  ],
  "constraints": [
    "Apply the new background globally from a single shared location (global stylesheet and/or root layout), not via per-page styling changes.",
    "Replace (do not layer on top of) the existing dual green gradients currently implemented via the `gradient-bg-right` class.",
    "Keep all existing routes, layouts, and route-transition UX behavior intact."
  ],
  "nonGoals": [
    "Do not redesign page layouts, typography, or component structure beyond what is necessary to apply the new global background.",
    "Do not add any new navigation items or routes as part of this change.",
    "Do not modify backend canister logic."
  ],
  "imageRequirements": {
    "required": [
      "Abstract vector background with prominent flowing geometric layers, green-to-teal gradient (telsfx-abstract-bg.dim_1920x1080.svg)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}