{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Global green-to-teal abstract vector background replacing dual green gradients",
  "requirements": [
    {
      "id": "REQ-93",
      "summary": "Add a new original, pronounced green-to-teal abstract vector background SVG asset for global use.",
      "acceptanceCriteria": [
        "A new vector background asset (SVG) exists under `frontend/public/assets/generated/` and visually transitions from green to teal with prominent abstract shapes.",
        "The background is original and does not use any third-party branding, logos, or copyrighted artwork."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/telsfx-abstract-bg.dim_1920x1080.svg",
          "operation": "create",
          "description": "Create the original abstract vector background SVG asset with a pronounced green-to-teal transition and prominent flowing/geometric layers (as specified in imageRequirements). Ensure no third-party branding/logos/copyrighted artwork is included."
        }
      ]
    },
    {
      "id": "REQ-94",
      "summary": "Replace the existing global dual-layer green gradient background with the new SVG background applied globally from a single shared location, without affecting routes or transitions.",
      "acceptanceCriteria": [
        "The previous dual-gradient effect is no longer visible anywhere in the app (no remaining `::before/::after` radial gradient layers for `gradient-bg-right`).",
        "All pages/routes show the new vector green-to-teal background consistently, without per-page modifications.",
        "Foreground content (header, pages, footer, cards) remains readable and layered above the background (no interference with clicks/scrolling).",
        "No existing routes, navigation behavior, or route-transition spinner/fade behavior is changed by this background update."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Remove the existing `.gradient-bg-right` `::before/::after` dual radial gradient definitions (and any related custom properties if unused). Add a single global background class (e.g., `.app-vector-bg`) that applies the new SVG from `frontend/public/assets/generated/telsfx-abstract-bg.dim_1920x1080.svg` as a fixed, non-interactive background layer (pointer-events none) behind all content (safe z-index/positioning) so readability and click/scroll interactions are preserved."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the root layout container to stop using `gradient-bg-right` and instead use the new global background class (e.g., `app-vector-bg`) so the SVG background is applied across all routes/pages from one shared place without changing routing or route-transition behavior."
        }
      ]
    }
  ]
}